import math
"""
პირველივე იდეა რაც ამ ამოცანის წაკითხის დროს მომივიდა იყო, რომ შემოსული რიცხვი ჩამეწერა სტრინგად და ისე შემომებრუნა(რაც სავარაუდოდ ყველაზე მარტივი ვარიანტია)
თუმცა გადავწყვიტე, რომ ამოცანა ამომეხსნა სტრინგების გამოყენების გარეშე (უფრო საინტერესო და სახალისო, რომ ყოფილიყო ამოცანა)
ამონახსნი სტრინგებით დავწერე ცალკე ფაილში (Task_3-v2)
"""
n = int(input("შეიყვანეთ რიცხვი 0-დან 10000-მდე: "))

while not 0 <= n < 10000:
    n = int(input("რიცხვი გაცდა ზღვარს! შეიყვანეთ თავიდან: "))

if n == 0:
    print("sum = 0\nreversed = 0")
    exit()

#აქ უკვე ვერანაირად ვერ ვნახე, თუ როგორ შეიძლებოდა სტრინგის გარეშე დამებეჭდა "1300" -> "0031"
#ამიტომ გადავწყვიტე ეს ბოლო ნულები მომეცილებინა რიცხვისთვის და კოდის ბოლოს მიმემაგრებინა რევერსდისთვის თავში
nulls = ""
while n % 10 == 0:
    nulls += "0"
    n //= 10

sum = 0
reversed = 0
counter = 0
n_length = int(math.log(n, 10))
N_LENGTH = n_length + 1

while counter < N_LENGTH:
    sum += n % 10

    reversed *= 10
    reversed += n % 10

    n //= 10
    n_length -= 1
    counter += 1

print("sum =", int(sum))
print(f"reversed = {nulls}{reversed}")


